# DividedPathCannotCreateFromGeometry Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..DividedPathFailures..::..DividedPathCannotCreateFromGeometry Property
BuiltInFailures..::..DividedPathFailures Class See Also
---
Highlighted geometry contains a path or edge that could not be divided.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId DividedPathCannotCreateFromGeometry { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property DividedPathCannotCreateFromGeometry As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ DividedPathCannotCreateFromGeometry {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..DividedPathFailures Class
Autodesk.Revit.DB Namespace